{"paper_id": "astro-0001", "title": "Dark matter halos in dwarf galaxies", "chunk_id": 0, "passage": "We analyze the density profiles of dark matter halos in nearby dwarf galaxies and compare core vs cusp scenarios using stellar kinematics.", "category": "astro-ph.GA"}
{"paper_id": "astro-0002", "title": "Fast Radio Bursts from magnetars", "chunk_id": 0, "passage": "We model repeating fast radio bursts as magnetar-driven magnetospheric reconnection events and explore dispersion and scattering in host galaxies.", "category": "astro-ph.HE"}
{"paper_id": "astro-0003", "title": "Exoplanet atmospheric retrieval with transmission spectra", "chunk_id": 0, "passage": "Using near-infrared transmission spectroscopy we retrieve molecular abundances and cloud properties in warm Neptune exoplanet atmospheres.", "category": "astro-ph.EP"}
{"paper_id": "astro-0004", "title": "Gravitational wave background from supermassive binaries", "chunk_id": 0, "passage": "Pulsar timing array signals suggest a stochastic gravitational wave background produced by inspiraling supermassive black hole binaries.", "category": "astro-ph.CO"}
{"paper_id": "astro-0005", "title": "Galactic cosmic rays and star formation", "chunk_id": 0, "passage": "We present a model linking galactic cosmic ray flux to molecular cloud ionization rates and the regulation of star formation efficiency.", "category": "astro-ph.GA"}
{"paper_id": "astro-0006", "title": "LIGO–Virgo constraints on binary neutron star mergers", "chunk_id": 0, "passage": "We reanalyze the LIGO–Virgo catalog to constrain the equation of state via tidal deformabilities inferred from binary neutron star events.", "category": "gr-qc"}
{"paper_id": "astro-0007", "title": "Protoplanetary disk substructures with ALMA", "chunk_id": 0, "passage": "High-resolution ALMA observations reveal rings and gaps in protoplanetary disks potentially carved by young planets and dust evolution.", "category": "astro-ph.EP"}
{"paper_id": "astro-0008", "title": "Dark energy equation of state from BAO and SNe", "chunk_id": 0, "passage": "Combining baryon acoustic oscillations with Type Ia supernova distances we obtain constraints on a time-varying dark energy equation of state.", "category": "astro-ph.CO"}
{"paper_id": "astro-0009", "title": "AGN feedback in galaxy clusters", "chunk_id": 0, "passage": "We simulate radio-mode AGN feedback and its impact on intracluster medium cooling flows, entropy profiles, and star formation suppression.", "category": "astro-ph.GA"}
{"paper_id": "astro-0010", "title": "Kilonova radiative transfer with r-process opacities", "chunk_id": 0, "passage": "Radiative transfer calculations with lanthanide opacities reproduce the red component of kilonova light curves following compact object mergers.", "category": "astro-ph.HE"}
